// একটা html css javas দুইটি একসাতে করার হিসাব ***video--24.1***///

// HTML= মানে ! দিলে css add kre title নিচে link css ||
//  ar javas ট্যাগের add kre body ট্যাগের উপরে দিতে হয় 
// তার হিসাব 

// ***document imput***** dokomets**

// ----------------------------------------------------------------------------------------;

// ***document দকমেট কাজ "." পতিকের কাজ  ***video--24.2***

// document.getElementsByTagName মানে ট্যাগ খুজে বের করে | কোড কাজ করা
// যাবে না বিয়জারে গিয়ে কাজ করা।

// এই সব কাজ আবার কোড করতে পারি যেমন-- main ba footer ট্যাগের নিচে হল <script> ট্যাগে সব কাজ। jemon--

/* <script>
    const Rakib=document.getElementsByTagName(h1);
    for(const Rabbi of Rakib){
        console.log(Rabbi)
    }
</script>

সব ট্যাগ দিতে পারি যেমন -h1 বা li বা ul বা id বা class দিতে পারি||
 */
// -------------------------------------------------------------------------------------------------------;

// *** id class ডোম থেকে বের করে নিয়ে আসে তার হিসাব **video--24.3**//

// *** document.getElementById('Rabbi').innerText মানে id দ্বারা বুজানো হয়ছে ।। innerText মানে id ভিতর যা যা লেখা আছে তা তা দিবে।।

// *** document.getElementsByClassName('Rabbi').innerText মানে Class দ্বারা বুজানো হয়ছে।। innerText মানে id ভিতর যা যা লেখা আছে তা তা দিবে।।

// -------------------------------------------------------------------------------------------------------;

// **id class করে ১ম টা li ট্যাগ আনতে পারি আবার সব li ট্যাগও আনতে পারি তার হিসাব  **video--24.4***//

// *** document.querySelector('#Rabbi') মানে id সব বিষয় পাওয়া যাবে তার /('#Rabbi').innerText পরে যদি দেই তাহলে id
// ভিতর যা যা লেখা থাকবে তা দেখা যাবে।। এটা মানে id বা ul>li যদি Class দেই তাহলে ১ম তা দেখা যাবে।।

// *** const Rabbi = document.querySelectorAll('.Rabbi') মানে Class সব বিষয় পাওয়া যাবে ('.Rabbi').innerText 
// ভিতর যা যা লেখা থাকবে তা দেখা যাবে ।। . দেই তাহলে Class সব বিষয় পাওয়া যাবে ।।
// আবার # দেই তাহলে id সব বিষয় পাওয়া যাবে ।।

// --------------------------------------------------------------------------------------------------------

// ***বাকি সব খাতায় লেখা আসে তার গুরুতপুরন বিষয়****
